Autodesk.Revit.DB.Macros.MacroModule.GetEnumerator
Returns an enumerator that iterates through a collection.
Returns: An IEnumerator object that can be used to iterate through the collection.

Autodesk.Revit.DB.Macros.MacroModule.GetBasicIEnumerator
Returns an enumerator that iterates through a collection.
Returns: An IEnumerator object that can be used to iterate through the collection.

Autodesk.Revit.DB.Macros.MacroModule.GetMacroModuleIterator
Returns a Macro module iterator that iterates through the collection.
Returns:
A Macro module iterator object that can be used to iterate through key-value pairs in the collection.
Since:
2014

Autodesk.Revit.DB.Macros.MacroModule.GetMacro(System.String)
Gets the macro with the give name.
name:
The macro name.
Returns:
The macro.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.Macros.MacroModule.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Macros.MacroModule.ModuleStatus
The module status.
Since:
2014

Autodesk.Revit.DB.Macros.MacroModule.MacroManager
The Macro manager.
Since:
2014

Autodesk.Revit.DB.Macros.MacroModule.MacroLanguageType
The Macro language type.
Since:
2014

Autodesk.Revit.DB.Macros.MacroModule.SourceFile
Since:
2014

Autodesk.Revit.DB.Macros.MacroModule.Environment
The Macro environment.
Since:
2014

Autodesk.Revit.DB.Macros.MacroModule.ModuleFolder
The module folder.
Since:
2014

Autodesk.Revit.DB.Macros.MacroModule.ProjectFileName
Since:
2014

Autodesk.Revit.DB.Macros.MacroModule.Name
The name of the module.
Since:
2014

Autodesk.Revit.DB.Macros.MacroModule
A container for individual macros. As it relates to the macros editor, one MacroModule represents
a project that can be loaded and edited from within the editor.
Since:
2014